Table of Contents
 Class BIMItemId
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
[DataContract]
public class BIMItemId
Inheritance
object
BIMItemId
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Properties
 Id
[DataMember]
public int Id { get; set; }
Property Value
int
 Type
[DataMember]
public BIMItemType Type { get; set; }
Property Value
BIMItemType
 Edit this page